<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("VR оборудование");
?><h2 class="section-title">Как работают VR-очки</h2>
<p>
	 Существованием этой технологии мы&nbsp;обязаны устройству человеческих глаз. Благодаря бинокулярному зрению&nbsp;(зрение, в&nbsp;котором используются два глаза)&nbsp;мы&nbsp;можем различать не&nbsp;только цвета, но&nbsp;и&nbsp;глубину&nbsp;— так мы&nbsp;определяем расстояние до&nbsp;объектов и&nbsp;поэтому не&nbsp;врезаемся в&nbsp;препятствия.
</p>
<p>
 <span><br>
 </span>
</p>
 <figure>
<p>
</p>
 <img src="https://248006.selcdn.ru/main/upload/setka_images/11401622032020_4722513d69363eb8e301bcbc5a9b6b244943d87f.png" title="Что видит мозг"><br>
 <figcaption style="width: 503.3px;">Что видит мозг</figcaption></figure><br>
<p>
	 Картинки почти идентичны, но&nbsp;можно заметить, что ракурсы немного различаются. Мозг накладывает эти изображения друг на&nbsp;друга так, как это показано на&nbsp;схеме ниже:
</p>
<p>
 <span><img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_e3ea06ecc4efe66fd609360c227a5daace25eda6.png"><br>
 </span>
</p>
<p>
</p>
<p>
	 Цветами обозначены глаза и&nbsp;поле зрения каждого из&nbsp;них. Там, где поля пересекаются, образуется область, в&nbsp;которой мы&nbsp;можем воспринимать глубину. Всё остальное&nbsp;— периферийное зрение. <span style="font-size: 14pt;"> </span><br>
</p>
<p>
</p>
<p>
	 Мозг складывает оба изображения, чтобы в&nbsp;итоге получилось одно; именно его мы&nbsp;и&nbsp;видим.
</p>
 <figure><img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_6a4e9b3ae3023faad72ace61e6264ce47ed78056.png" title="Что видит человек"><br>
 Что видит человек</figure>
<p>
	 VR-шлемы оснащены двумя мониторами&nbsp;(или одним, который разделён на&nbsp;две части). Каждый из&nbsp;этих мониторов показывает отдельные изображения для каждого глаза. А&nbsp;чтобы правильно сфокусировать взгляд, используются&nbsp;линзы. <br>
</p>
 <figure><img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_b7f630640f2efffc4c41d0d6466d02c19b3b342c.png"><br>
 </figure>
<p>
</p>
<p>
	 Линзы помогают сфокусировать взгляд так, что мозг воспринимает игровой мир как реальный и&nbsp;более реалистичный&nbsp;— это происходит благодаря когнитивному искажению. Поэтому даже посредственная по&nbsp;современным меркам графика выглядит хорошо. Это на&nbsp;руку как разработчикам, так и&nbsp;игрокам, потому что устройству требуется в&nbsp;два раза больше ресурсов, чтобы рендерить сразу два изображения вместо одного. <br>
</p>
<p>
	 Если&nbsp;линзы настроены правильно, картинка получается правдоподобной. Если&nbsp;же&nbsp;нет, то&nbsp;это может&nbsp;быть причиной как ухудшения изображения, так и&nbsp;тошноты.<br>
</p>
<p>
	 Также на&nbsp;самочувствие человека влияет частота кадров. Раньше считалось, что&nbsp;90&nbsp;кадров в&nbsp;секунду достаточно, чтобы сделать погружение максимально правдоподобным. Появление шлема с&nbsp;частотой обновления мониторов в&nbsp;144&nbsp;Hz&nbsp;показало, что&nbsp;90&nbsp;кадров&nbsp;— не&nbsp;предел. Разумеется, если частота будет низкой, то&nbsp;от&nbsp;дёрганого изображения станет плохо.<br>
</p>
<div>
	 В&nbsp;конце концов, не&nbsp;стоит игнорировать и&nbsp;особенности организма. Например, если вестибулярный аппарат плохо развит, то&nbsp;человека будет укачивать даже в&nbsp;самом продвинутом шлеме.
</div>
<h2></h2>
<h2>Каким&nbsp;бывает VR </h2>
<p>
</p>
<p>
	 На&nbsp;данный момент есть два основных варианта использования VR-шлема&nbsp;— видео в&nbsp;формате&nbsp;360&nbsp;градусов и&nbsp;игры. В&nbsp;первом случае берётся уже существующая запись, а&nbsp;потом разбивается на&nbsp;два экрана. <br>
</p>
<p>
	 Что&nbsp;же&nbsp;касается игр и&nbsp;любых&nbsp;3D-пространств, то&nbsp;тут для пользователя изначально готовятся два разных изображения, которые выводятся отдельно для каждого глаза.<br>
</p>
<p>
	 Для этого в&nbsp;пространстве устанавливается сразу две камеры вместо одной. Они располагаются рядом, как глаза человека.
</p>
<h2></h2>
<h2>Какие VR-шлемы&nbsp;бывают </h2>
<p>
</p>
<p>
	 Устройства для VR&nbsp;бывают двух типов:
</p>
<ol>
	<li>Полноценные VR-наборы (VR-Kit), в&nbsp;которые входят шлемы, камеры и&nbsp;контроллеры.</li>
	<li>Cardboard&nbsp;— очки, для работы которых нужен смартфон.</li>
</ol>
<p>
</p>
<p>
	 Самые известные наборы&nbsp;— это HTC Vive, Oculus Rift, PS&nbsp;VR&nbsp;и&nbsp;Valve Index.
</p>
 <figure><img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_27e9aa5bdf801f94f7728fe14d1ac08405e5a691.png" title="Valve Index"><br>
 <figcaption style="width: 503.3px;">Valve Index</figcaption></figure>
<p>
</p>
<p>
	 Стоят они достаточно дорого&nbsp;— за&nbsp;эти деньги можно купить приличный игровой ноутбук. Но&nbsp;тут за&nbsp;эту сумму вы&nbsp;приобретаете опыт, который невозможно получить с&nbsp;помощью дешёвых&nbsp;Cardboard.<br>
</p>
<p>
</p>
<p>
	 Контроллеры помогают управлять игрой или приложением, а&nbsp;камеры служат дополнительным источником ввода (считывают движения игрока) и&nbsp;средством безопасности: вы&nbsp;можете отметить границы, за&nbsp;которые нельзя выходить, а&nbsp;камеры будут предупреждать вас, когда вы&nbsp;будете возле этих границ. <br>
</p>
 <figure><img src="https://248006.selcdn.ru/main/upload/setka_images/11401622032020_4fb6fa4fbc0158ec7cf1e48acc6733dd567fe239.png" title="Камеры HTC Vive"><br>
 <figcaption style="width: 503.3px;">Камеры HTC Vive</figcaption></figure>
<p>
</p>
<p>
	 Контроллеры устроены сложнее, чем клавиатура или мышь,&nbsp;— в&nbsp;них есть не&nbsp;только кнопки, но&nbsp;и&nbsp;различные датчики. Рассмотрим на&nbsp;примере контроллеров для Valve Index.
</p>
<p>
</p>
 <img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_8bc1aa9ad985c6b5f9a267787eba176dd734e55f.png"><br>
<p>
</p>
<p>
	 Эти контроллеры определяют расстояние от&nbsp;рукоятки до&nbsp;каждого из&nbsp;ваших пальцев, а&nbsp;также силу нажатия, положение руки и&nbsp;многие другие вещи&nbsp;— датчиков в&nbsp;контроллере больше&nbsp;80. Это позволяет показать в&nbsp;игре реалистичные руки, которые будут повторять движения игрока.
</p>
 <figure><img src="https://skillbox.ru/upload/setka_images/11401622032020_b0db57166028d10b861a6ceedc3e58d5dd8b10d0.gif"><br>
 </figure>
<p>
</p>
<p>
	 В&nbsp;шлеме тоже есть датчики. Например, гироскоп, который позволяет фиксировать положение и&nbsp;наклон головы. Но&nbsp;это не&nbsp;единственный вариант. Так, например, PS&nbsp;VR&nbsp;захватывает ваши движения с&nbsp;помощью камеры&nbsp;— на&nbsp;шлеме располагаются светящиеся полоски, по&nbsp;которым консоль понимает, в&nbsp;каком положении ваша голова.
</p>
 <figure><img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_db52642fc67f6c7c46657360f234a883af322464.png"><br>
 </figure>
<p>
</p>
<p>
	 Что&nbsp;же&nbsp;касается Cardboard, то&nbsp;это просто держатель для телефона с&nbsp;линзами. <br>
</p>
 <figure><img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_d58f50d1222620cd1cfe95da3a91221bd0d26e65.png"><br>
 </figure>
<p>
	 Такой шлем можно собрать самостоятельно, скачав&nbsp;<a href="https://arvr.google.com/cardboard/get-cardboard/" target="_blank">инструкцию от&nbsp;Google</a>.
</p>
 <figure><img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_51f6f1668dfb2cd28d94728ed419d478538b3006.png"><br>
 </figure>
<p>
	 Либо вы&nbsp;можете найти готовый Cardboard в&nbsp;магазине&nbsp;— цены начинаются от&nbsp;500&nbsp;рублей, если не&nbsp;ниже. Конечно, качество у&nbsp;настолько дешёвых вариантов плохое.
</p>
<p>
	 Бюджетные варианты позволяют управлять игрой или приложением с&nbsp;помощью смартфона. Но&nbsp;так как тачскрин недоступен из-за шлема, остаётся только гироскоп. Поэтому для Cardboard можно&nbsp;либо создавать очень простые игры,&nbsp;либо снимать видеоаттракционы.
</p>
<p>
	 Также существует Gear VR&nbsp;— устройство от&nbsp;Samsung, в&nbsp;которое также вставляется смартфон. От&nbsp;Cardboard оно отличается тем, что на&nbsp;шлеме есть контроллер.
</p>
<p>
</p>
 <figure><img src="https://248006.selcdn.ru/main/upload/setka_images/11401522032020_c3d4b76cd89b05f2c8e5da53f69c6d45806e9160.png"><br>
 </figure>
<p>
</p>
<p>
	 Но&nbsp;для него, ожидаемо, можно использовать только некоторые модели смартфонов Samsung. <br>
	 Для других смартфонов есть шлемы вроде FreeFly VR, с&nbsp;которым тоже идёт контроллер, но&nbsp;такой вариант более дорогой&nbsp;— около&nbsp;10&nbsp;000&nbsp;рублей.
</p>
<p>
	 Среди основных компаний на рынке VR оборудования можно выделить следующие: Sony, Oculus, HTC. На диаграмме ниже представлено процентное соотношение компаний на рынке.
</p>
<p>
	 <?$APPLICATION->IncludeComponent(
	"chart",
	"",
	Array(
		"CHART_TYPE" => "pie",
		"IBLOCKS" => "10",
		"IBLOCK_TYPE" => "statsVr"
	)
);?><br>
</p>
 <br><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>