<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("История VR");
?><h2>История VR</h2>
<p>
	 Первый прототип VR-очков появился ещё в 1837 году. Называлось это устройство — стереоскоп. Правда стереоскоп работал исключительно со статическими изображениями, но внешне он очень похож на современные очки виртуальной реальности. Работа стереоскопа проста, но для тех времён удивительна: в аппарат устанавливались два, казалось бы, одинаковых изображения, но сделанных под разным углом, таким образом создавался эффект объёмного изображения.
</p>
 <img src="https://leonardo.osnova.io/8b028eb4-4f4f-ad2a-2ae6-6afca87f9816/-/preview/2100/-/format/webp/"><br>
 Советские стереоскопы<br>
<p>
	 Это были лишь первые и не менее важные шаги на пути к современным VR шлемам. Стереоскопов людям было недостаточно. Всё развивалось, и для погружения в иную реальность на помощь картинам пришли фотографии, а после появились кинофильмы. <br>
</p>
<p>
</p>
<p>
	 История популярных ныне 4D-кинотеатров началась с 1956 года! Тогда Мортон Хейлиг придумал как можно максимально погрузить зрителя в происходящее на экране. Придуманный им аппарат назывался Sensorama, из новшеств было подвижное сиденье с вибрацией, имитация ветра и запахов, поддержка цветной картинки со стерео звуком.
</p>
<p>
 <img src="https://leonardo.osnova.io/4e952dce-2871-573e-a953-80423a9ee472/-/preview/700/-/format/webp/" align="middle"><br>
</p>
<p>
</p>
<p>
	 Вполне ожидаемо, что столь интересный и в то же время дорогой проект в полном объеме реализоваться не смог. И все же, данное изобретение не только дало Мортону Хейлигу звание «отца виртуальной реальности», но и сделало большой вклад в VR индустрию. Скотт Фишер, будучи руководителем проекта виртуальной среды VIEW от NASA, говорил о большом вкладе Sensorama в его проект. К разработкам NASA вернёмся чуть позже.
</p>
<p>
</p>
<p>
	 Поэтому перенесемся в 60-е годы в лабораторию компании Philco. В 1961 году Philco Company представила проект первого HMT шлема — Headsight. HMT (head motion tracking) — система, которая регистрировала повороты устройства в пространстве в соответствии с тремя углами Эйлера. Это значит, что с помощью данной системы у «зрителя» появлялась возможно осмотреться по сторонам, вращая головой. К сожалению, шлем не покинул пределы лаборатории Philco.
</p>
<p>
 <img src="https://leonardo.osnova.io/106e44d9-d519-b2fe-4be7-9c81c6174817/-/preview/1200/-/format/webp/" align="middle"><br>
</p>
<p>
	 Более удачным проектом оказался The Sword of Damocle’s. С 1965 по 1968 в Гарвардсокм университете шла разработка Айвена Сазерленда и Боба Спроула. Шлем также был оснащен системой HMT. Устройство было больших габаритов и не позволяло свободно передвигаться. Данный проект считается первым шлемом дополненной реальности. К слову, Айвен сделал довольно большой вклад в развитие трехмерной графики и графики в целом.<br>
</p>
<p>
 <img src="https://leonardo.osnova.io/8cb1fd9d-d2a5-dd41-5d0a-bdc360b859a1/-/preview/1300/-/format/webp/" title="The Sword of Damocle's">
</p>
<p>
</p>
 The Sword of Damocle's<br>
<p>
	 Первые коммерческие устройства виртуальной реальности появились только в начале 90-ых. Компания VPL Research в 1989 представила рынку свою новую систему — EyePhone. Устройство состояло из очков виртуальной реальности и специальных перчаток (DataGloves). Цена этой «игрушки» была немаленькая — $250,000, в комплекте шли компьютеры для работы системы. Цена была не единственной проблемой, в то время «EyePhone» мог воспроизводить только 7 кадров в секунду, в отличие от телевизоров с их тридцатью кадрами. <br>
</p>
<p>
</p>
<p>
	 По вышеуказанным причинам система не получила широкого распространения, зато какой вклад она внесла в дальнейшее развитие виртуальной индустрии! Компанией VPL Research были разработаны очки, перчатки, а также целый костюм для виртуальной реальности. Для разработчиков был создан графический движок Isaac и новый язык визуального программирования Body Electric.
</p>
<p>
</p>
<p>
	 Интересно, что NASA работала совместно с VPL Research по вышеупомянутому проекту VIEW. Калифорнийский отдел NASA работал над устройством шлема, а VPL в первую очередь над программной составляющей.
</p>
<p>
</p>
<p>
	 Проект, основанный небезызвестной компанией SEGA в 1993 году, оказался в итоге так и нереализованным. Шлем должен был стать дополнением к Sega Mega Drive. Он представлял из себя уже известную HMT систему, LCD экран и стерео наушники. Первый прототип был показан в 1993 году на Summer CES специально для журналистов. Цена гаджета была всего 200$, по сравнению с предшественниками — это значительный прогресс: вес очков был небольшой, голова чувствовала себя комфортно и не болела после длительного ношения. Тогда что же привело к закрытию этот перспективный проект? <br>
</p>
<p>
</p>
<p>
	 Британская газета The Independent on Sunday после Summer CES напишет статью, где заявит о небезопасном ношении очков, после чего Стэнфордский научно-исследовательский институт заявил о возможном вреде для глаз. После этих заявлений релизы по всему миру были отменены. В октябре 1994 представитель SEGA заявил о продолжении работы над SEGA VR. Но после о проекте новостей не поступало, он был тихо закрыт, так и не дойдя до рынка потребителей.
</p>
 <img src="https://leonardo.osnova.io/d173550d-98d8-87f0-a3c8-1d3edb21352e/">
<p>
	 В 1995 году на прилавках Японии и США появляется неожиданный для фанатов Nintendo аппарат — Virtual Boy. Стоимость составляла около 180$. Экран шлема был монохромный, что снизило его цену и уменьшило в размере, наушников не было, для перемещения в трехмерном пространстве использовался контроллер формы «M». <br>
</p>
<p>
</p>
<p>
	 Однако Nintendo ждал крупный провал, не помогло и снижение цены на шлем. Одна из ошибок — сырость проекта. Его старались сделать быстро, так как весь мир был в ожидании нового Nintendo 64. Из-за этого проект показался людям проходным, да и от Nintendo не получил должного внимания. Ещё одной ошибкой было позиционирование проекта как портативного. Добавим малое количество игр, отголоски прошлого о вреде для зрения, а также монохромных черно-красный экран, — всё это негативно повлияло на продажи Virtual Boy.
</p>
<p>
</p>
<p>
	 В том же 1995 году выходит более успешный продукт — VFX1 Headgear. Стартовая цена составила около 695$, но позже снизилась до 599$. Данный шлем уже больше похож на современные девайсы. Он состоял из LCD дисплея разрешением 263x230, отображал 256 цветов, в шлем был встроен микрофон и стерео наушники. <br>
</p>
<p>
	 Самое интересное в этом комплекте — контроллер Cyberpuck. Он включал в себя 3 кнопки, а внутри находился гироскоп, с помощью которого осуществлялось передвижение. Персонаж игрока двигался в ту сторону, в которую был наклонён манипулятор. И это один из первых и весьма интересных способов передвижения в игре, проблема которого до сих пор полностью не решена.
</p>
<p>
</p>
<p>
</p>
<p>
	 Как видим, VR индустрия делала очень большие шаги в нужном направлении. За 20 лет инженеры смогли прийти от лабораторных экземпляров до коммерческой продукции. Уже в 95-ом в магазинах имелся доступный продукт, крайне схожий с современными прототипами.
</p>
 <br>
<p>
</p><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>